#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan for Prod Deployment</summary>

```

terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_api_gateway_rest_api.utils will be created
  + resource "aws_api_gateway_rest_api" "utils" {
      + api_key_source               = (known after apply)
      + arn                          = (known after apply)
      + binary_media_types           = (known after apply)
      + created_date                 = (known after apply)
      + description                  = "API Endpoint for S3 Audit in the dev environment"
      + disable_execute_api_endpoint = (known after apply)
      + execution_arn                = (known after apply)
      + id                           = (known after apply)
      + minimum_compression_size     = (known after apply)
      + name                         = "dev-S3-Utility-API"
      + policy                       = (known after apply)
      + region                       = "eu-west-1"
      + root_resource_id             = (known after apply)
      + tags_all                     = (known after apply)

      + endpoint_configuration {
          + ip_address_type  = (known after apply)
          + types            = [
              + "REGIONAL",
            ]
          + vpc_endpoint_ids = (known after apply)
        }
    }

  # aws_iam_role.s3_audit_role will be created
  + resource "aws_iam_role" "s3_audit_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dev-s3-audit-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.s3_audit_lambda will be created
  + resource "aws_iam_role_policy_attachment" "s3_audit_lambda" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "dev-s3-audit-role"
    }

  # aws_lambda_alias.s3_audit_alias will be created
  + resource "aws_lambda_alias" "s3_audit_alias" {
      + arn              = (known after apply)
      + description      = "S3 Audit Alias"
      + function_name    = (known after apply)
      + function_version = "1"
      + id               = (known after apply)
      + invoke_arn       = (known after apply)
      + name             = "main"
      + region           = "eu-west-1"
    }

  # aws_lambda_function.s3_audit_lambda will be created
  + resource "aws_lambda_function" "s3_audit_lambda" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "dev-s3-audit"
      + handler                        = "s3-audit.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = true
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-1"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs22.x"
      + s3_bucket                      = "dev-s3-audit-service-deployment"
      + s3_key                         = "initial_deployment/deployment.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ENVIRONMENT" = "dev"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.s3_audit_api_gateway will be created
  + resource "aws_lambda_permission" "s3_audit_api_gateway" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "dev-s3-audit"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + region              = "eu-west-1"
      + source_arn          = (known after apply)
      + statement_id        = "AllowExecutionFromAPIGateway"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket.s3_audit_service_bucket will be created
  + resource "aws_s3_bucket" "s3_audit_service_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "dev-s3-audit-service-deployment"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "eu-west-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_versioning.s3_audit_service_bucket_versioning will be created
  + resource "aws_s3_bucket_versioning" "s3_audit_service_bucket_versioning" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "eu-west-1"

      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }

  # aws_security_group.allow_tls will be created
  + resource "aws_security_group" "allow_tls" {
      + arn                    = (known after apply)
      + description            = "Test SG for pipeline"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my_test_sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-c554eebc"
    }

  # aws_security_group.another_to_test will be created
  + resource "aws_security_group" "another_to_test" {
      + arn                    = (known after apply)
      + description            = "Test SG for pipeline"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "my_test_sg_a"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + region                 = "eu-west-1"
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-c554eebc"
    }

  # module.api_s3_audit_post.aws_api_gateway_deployment.deployment will be created
  + resource "aws_api_gateway_deployment" "deployment" {
      + created_date = (known after apply)
      + id           = (known after apply)
      + region       = "eu-west-1"
      + rest_api_id  = (known after apply)
      + triggers     = (known after apply)
    }

  # module.api_s3_audit_post.aws_api_gateway_integration.lambda_integration will be created
  + resource "aws_api_gateway_integration" "lambda_integration" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "POST"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + region                  = "eu-west-1"
      + resource_id             = (known after apply)
      + rest_api_id             = (known after apply)
      + timeout_milliseconds    = 29000
      + type                    = "AWS"
      + uri                     = (known after apply)
    }

  # module.api_s3_audit_post.aws_api_gateway_integration_response.proxy will be created
  + resource "aws_api_gateway_integration_response" "proxy" {
      + http_method = "POST"
      + id          = (known after apply)
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.api_s3_audit_post.aws_api_gateway_method.proxy will be created
  + resource "aws_api_gateway_method" "proxy" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "eu-west-1"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.api_s3_audit_post.aws_api_gateway_method_response.proxy will be created
  + resource "aws_api_gateway_method_response" "proxy" {
      + http_method = "POST"
      + id          = (known after apply)
      + region      = "eu-west-1"
      + resource_id = (known after apply)
      + rest_api_id = (known after apply)
      + status_code = "200"
    }

  # module.api_s3_audit_post.aws_api_gateway_resource.root will be created
  + resource "aws_api_gateway_resource" "root" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "s3audit"
      + region      = "eu-west-1"
      + rest_api_id = (known after apply)
    }

  # module.api_s3_audit_post.aws_api_gateway_stage.deployment will be created
  + resource "aws_api_gateway_stage" "deployment" {
      + arn           = (known after apply)
      + deployment_id = (known after apply)
      + execution_arn = (known after apply)
      + id            = (known after apply)
      + invoke_url    = (known after apply)
      + region        = "eu-west-1"
      + rest_api_id   = (known after apply)
      + stage_name    = "dev"
      + tags_all      = (known after apply)
      + web_acl_arn   = (known after apply)
    }

Plan: 17 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @rgrhodesdev, Action: `pull_request`*